ConverginDivergingNozzle/common/constant/thermo.common
mixture
{
    specie
    {
        nMoles          1;
        molWeight       28.96;
    }
    thermodynamics
    {
        Cp              1005;
        Hf              2.544e+6;
    }
    transport
    {
        mu              0;
        Pr              0.7;
    }
}

